{"timestamp": "2025-05-25T21:45:11.541642", "label": "legitimate", "sender": "john.smith@example.com", "subject": "Question about your services", "is_spam": false, "category": "inquiry", "draft": "Subject: Re: Question about Your Services\n\nHi John,\n\nThank you for reaching out and expressing interest in our consulting packages. I would be happy to provide you with more information regarding our services, pricing, and availability.\n\nWe offer a variety of consulting packages tailored to meet the specific needs of our clients. Pricing typically varies based on the scope of the project and the level of support required. To give you a better idea, our packages range from [insert starting price] for basic consultations to [insert higher price] for comprehensive services that include [briefly list any additional features or services].\n\nAs for availability, we currently have openings starting from [insert dates or timeframe when you have availability]. If you have specific dates in mind, please let me know, and I will do my best to accommodate your schedule.\n\nI would be happy to discuss this further or arrange a call to better understand your needs and how we can assist you. Please feel free to reply to this email or call me directly at [insert phone number].\n\nLooking forward to hearing from you!\n\nBest regards,\n\n[Your Name]  \n[Your Position]  \n[Your Company]  \n[Your Contact Information]  \n[Your Company Website]  "}
{"timestamp": "2025-05-25T21:46:37.360068", "label": "legitimate", "sender": "sara.jones@customer.com", "subject": "Product not delivered\"", "is_spam": false, "category": "inquiry", "draft": "Subject: Re: Product Not Delivered\n\nDear Sara,\n\nThank you for reaching out to us regarding your order. I apologize for the inconvenience caused by the delay in delivery.\n\nI will look into the status of your order immediately and get back to you with an update as soon as possible. Please bear with us for a moment while I investigate this matter.\n\nIf you have any further questions or concerns in the meantime, please feel free to reach out.\n\nThank you for your patience and understanding.\n\nBest regards,\n\n[Your Name]  \n[Your Position]  \n[Your Company]  \n[Your Contact Information]  "}
{"timestamp": "2025-05-25T21:47:41.237939", "label": "spam", "sender": "investment@quickreturns.net", "subject": "Double your money in 7 days!", "is_spam": true, "category": null, "draft": null}
{"timestamp": "2025-05-25T21:48:38.973801", "label": "spam", "sender": "security@paypal-account.com", "subject": "URGENT: Verify your account", "is_spam": true, "category": null, "draft": null}
{"timestamp": "2025-05-25T21:52:20.094193", "label": "spam", "sender": "security@paypal-account.com", "subject": "URGENT: Verify your account", "is_spam": true, "category": null, "draft": null}
{"timestamp": "2025-05-26T11:48:40.658855", "label": "legitimate", "sender": "mohsin23@gmail.com", "subject": "tell me about How to apply for the leave", "is_spam": false, "category": "inquiry", "draft": "Subject: Re: Inquiry About Leave Application Process\n\nDear Mohsin,\n\nThank you for reaching out. I'd be happy to assist you with the process of applying for leave through the Aptech portal.\n\nTo apply for leave, please follow these steps:\n\n1. **Log into the Aptech Portal**: Use your credentials to access your account.\n2. **Navigate to the Leave Application Section**: Look for the 'Leave' or 'Time Off' section in the main menu.\n3. **Fill Out the Leave Request Form**: Enter the required details, including the type of leave, dates, and any additional information as needed.\n4. **Submit Your Request**: After reviewing your details, submit the form. You should receive a confirmation notification upon successful submission.\n5. **Check Application Status**: You can track the status of your application in the same section.\n\nIf you have any issues or need further assistance, feel free to reach out to me, or you can also contact the support team through the portal.\n\nBest regards,\n\n[Your Name]  \n[Your Position]  \n[Your Contact Information]  \n[Your Company]  "}
